#+TITLE: Contraindicated
#+AUTHOR: CIGMAH Team
#+DATE: <2019-08-03 Sat>
#+PROPERTY: header-args :session contraindicated :eval no-export :exports both
#+OPTIONS: toc:nil

* Solution

#+HTML: <details><summary>Click here to show the answer.</summary>
The ID of the single patient whose past medical history is in contention with
the contraindications of their antihypertensive is *Patient ID 8047*.
#+HTML: </details>

#+HTML: <details><summary>Click here to show the solution.</summary>

#+begin_quote
We haven't explained this step-by-step in full yet, but here's the solution as
it stands at the moment. A more detailed explanation will appear shortly.
#+end_quote

#+begin_src python :results output
# Open and read the file input
with open('./input-contraindicated.txt') as infile:
    RAW = infile.read()

# Split each patient's record
SEPARATOR = '-' * 80
SPLIT = [record.strip() for record in RAW.split(SEPARATOR)]

# Extract the data from each patient's record
import re
MATCH_RE = r'Patient ID: (\d+)\nAntihypertensive: (\w+)\nPMHx:(.*)'
MATCHER = re.compile(MATCH_RE, re.DOTALL)
SUBDIVIDED = [MATCHER.match(record) for record in SPLIT]

# Split and process each if required (split each history item)
PATIENT_IDS = [match[1] for match in SUBDIVIDED]
ANTI_HYPERTENSIVES = [match[2] for match in SUBDIVIDED]
HISTORIES = [set(re.findall(r'- ([A-Za-z\- ]+)', match[3])) for match in SUBDIVIDED]

# Rejoin the processed data
DATA = list(zip(PATIENT_IDS, ANTI_HYPERTENSIVES, HISTORIES))

from typing import Dict, Set
from enum import Enum

# Define a drug cclass enumeration for convenience
class DrugClass(Enum):
    A = 0
    B = 1
    C = 2
    D = 3

# Raw drugs by class
DRUG_AS = ' Captopril, Ramipril, Perindopril, Trandolapril, Candesartan '
DRUG_BS = ' Atenolol, Carvedilol, Metoprolol, Propranolol               '
DRUG_CS = ' Amlodipine, Nifedipine                                      '
DRUG_DS = ' Hydrochlorothiazide, Indapamide                             '

# Define a function to convert raw into dictionary to class
def extract(raw: str, drug_class: DrugClass) -> Dict[DrugClass, Set[str]]:
    """ Extract drugs into a dictionary mapping all to class.
    """
    drug_list = [drug.strip() for drug in raw.split(',')]
    return {drug: drug_class for drug in drug_list}

# Extract each and merge the dictionaries
DRUG_TO_CLASS = {
    **extract(DRUG_AS, DrugClass.A),
    **extract(DRUG_BS, DrugClass.B),
    **extract(DRUG_CS, DrugClass.C),
    **extract(DRUG_DS, DrugClass.D),
}

# Define dictionary mapping drug class to contraindications
CONTRAINDICATIONS = {
    DrugClass.A: set(['Renal artery stenosis']),
    DrugClass.B: set(['Asthma', 'Bradycardia', 'A-V block']),
    DrugClass.C: set(),
    DrugClass.D: set('Gout')
}

# Filter the list by set intersection between PMHx and contraindications
CONTENTION = [
    (patient, antihypertensive, pmhx)
    for patient, antihypertensive, pmhx in DATA
    if pmhx.intersection(CONTRAINDICATIONS[DRUG_TO_CLASS[antihypertensive]])
]

print(CONTENTION)
#+end_src

#+RESULTS:
: [('8047', 'Propranolol', {'Psoriasis', 'Asthma'})]

#+HTML: </details>

#+HTML: <details><summary>Click here to show another solution (in J).</summary>
#+begin_src j
Data =: fread < 'input-contraindicated.txt'
Records =: (80#'-') splitstring Data

Patients =: (CR taketo 'Patient ID: ' takeafter ]) each Records
Antihs =: (CR taketo 'Antihypertensive: ' takeafter ]) each Records
Histories =: (1}.CR taketo each '  - ' splitstring 'PMHx:' takeafter ]) each Records

DrugAs =: dltb each ',' splitstring 'Captopril, Ramipril, Perindopril, Trandolapril, Candesartan '
DrugBs =: dltb each ',' splitstring 'Atenolol, Carvedilol, Metoprolol, Propranolol               '
DrugCs =: dltb each ',' splitstring 'Amlodipine, Nifedipine                                      '
DrugDs =: dltb each ',' splitstring 'Hydrochlorothiazide, Indapamide                             '
Drugs =: DrugAs;DrugBs;DrugCs;<DrugDs

ContraAs =: <'Renal artery stenosis'
ContraBs =: 'Asthma';'Bradycardia';'A-V block'
ContraCs =: <0$0
ContraDs =: <'Gout'
Contras =: ContraAs;ContraBs;ContraCs;<ContraDs

PatientContras =: ([:>Contras {~ 1 i.~ [:; Drugs e.~ each <&<) each Antihs
Soln =: Patients {~ 1 i.~ ;PatientContras (+/@:e.) each Histories
#+end_src
#+HTML: </details>

